greenhouse_A/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/rotationAngle"

Ux #calc "cos($rotAngle*3.14159265359/180.0)";
Uy #calc "sin($rotAngle*3.14159265359/180.0)";

dimensions      [0 1 -1 0 0 0 0];

internalField  uniform (0.0 0.0 0.0);

boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            zeroGradient; 
    }

    inlet 
    {
        type            uniformFixedValue;
        uniformValue    constant ($Ux $Uy 0);
    }

    bottomWall
    {
        type            noSlip;
    }

    topWall
    {
        type            noSlip;
    }

    greenhouse
    {
        type            noSlip;
    }

    yMinusWall 
    {
        type            noSlip;
    }

    yPlusWall 
    {
        type            noSlip;
    }

}


// ************************************************************************* //
