greenhouse_A/0/include/rotationAngle
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Rotation angle in degrees

\*---------------------------------------------------------------------------*/

rotAngle 0.0; // degrees

// ************************************************************************* //
