greenhouse_A/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    yMinusWall
    {
        type            patch;
        nFaces          924;
        startFace       118184;
    }
    yPlusWall
    {
        type            patch;
        nFaces          924;
        startFace       119108;
    }
    inlet
    {
        type            patch;
        nFaces          924;
        startFace       120032;
    }
    outlet
    {
        type            patch;
        nFaces          924;
        startFace       120956;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1936;
        startFace       121880;
    }
    topWall
    {
        type            patch;
        nFaces          1936;
        startFace       123816;
    }
)

// ************************************************************************* //
