greenhouse_A/system/arc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

fields  ( grad(Phi) p mag(grad(Phi)) );

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type sets;
libs            ("libsampling.so");
writeControl    writeTime;

sets
(
     wall
     {
        type        arcUniform;
        centre      (0.0 0 0.0);
        normal      (0 1 0);
        radial      (1.0 0 0.0);
        startAngle  0.0;
        endAngle    -3.141592653589793; 
        nPoints     200;
        axis        xyz;
    }
);

// 
// sets
// (
//   somePoints
//   {
//    type cloud;
//    axis xyz;
//    points
//    (
//       ( 1.000100e+00  0.000000e+00  0.000000e+00 )
//       ( 9.995965e-01  0.000000e+00  3.173111e-02 )
//       ( 9.980865e-01  0.000000e+00  6.343026e-02 )
//       ( 9.955715e-01  0.000000e+00  9.506555e-02 )
//       ( 9.920540e-01  0.000000e+00  1.266051e-01 )
//       ( 9.875376e-01  0.000000e+00  1.580172e-01 )
//       ( 9.820269e-01  0.000000e+00  1.892702e-01 )
//       ( 9.755273e-01  0.000000e+00  2.203326e-01 )
//       ( 9.680455e-01  0.000000e+00  2.511731e-01 )
//       ( 9.595889e-01  0.000000e+00  2.817607e-01 )
//       ( 9.501661e-01  0.000000e+00  3.120646e-01 )
//       ( 9.397866e-01  0.000000e+00  3.420543e-01 )
//       ( 9.284608e-01  0.000000e+00  3.716996e-01 )
//       ( 9.162001e-01  0.000000e+00  4.009706e-01 )
//       ( 9.030168e-01  0.000000e+00  4.298379e-01 )
//       ( 8.889243e-01  0.000000e+00  4.582723e-01 )
//       ( 8.739368e-01  0.000000e+00  4.862454e-01 )
//       ( 8.580692e-01  0.000000e+00  5.137288e-01 )
//       ( 8.413377e-01  0.000000e+00  5.406949e-01 )
//       ( 8.237589e-01  0.000000e+00  5.671166e-01 )
//       ( 8.053508e-01  0.000000e+00  5.929672e-01 )
//       ( 7.861317e-01  0.000000e+00  6.182208e-01 )
//       ( 7.661210e-01  0.000000e+00  6.428519e-01 )
//       ( 7.453390e-01  0.000000e+00  6.668357e-01 )
//       ( 7.238064e-01  0.000000e+00  6.901480e-01 )
//       ( 7.015450e-01  0.000000e+00  7.127654e-01 )
//       ( 6.785773e-01  0.000000e+00  7.346652e-01 )
//       ( 6.549262e-01  0.000000e+00  7.558251e-01 )
//       ( 6.306157e-01  0.000000e+00  7.762241e-01 )
//       ( 6.056702e-01  0.000000e+00  7.958414e-01 )
//       ( 5.801149e-01  0.000000e+00  8.146574e-01 )
//       ( 5.539755e-01  0.000000e+00  8.326531e-01 )
//       ( 5.272782e-01  0.000000e+00  8.498104e-01 )
//       ( 5.000500e-01  0.000000e+00  8.661120e-01 )
//       ( 4.723183e-01  0.000000e+00  8.815415e-01 )
//       ( 4.441110e-01  0.000000e+00  8.960834e-01 )
//       ( 4.154566e-01  0.000000e+00  9.097230e-01 )
//       ( 3.863838e-01  0.000000e+00  9.224465e-01 )
//       ( 3.569219e-01  0.000000e+00  9.342413e-01 )
//       ( 3.271007e-01  0.000000e+00  9.450953e-01 )
//       ( 2.969501e-01  0.000000e+00  9.549977e-01 )
//       ( 2.665005e-01  0.000000e+00  9.639385e-01 )
//       ( 2.357825e-01  0.000000e+00  9.719087e-01 )
//       ( 2.048271e-01  0.000000e+00  9.789003e-01 )
//       ( 1.736655e-01  0.000000e+00  9.849062e-01 )
//       ( 1.423291e-01  0.000000e+00  9.899204e-01 )
//       ( 1.108493e-01  0.000000e+00  9.939378e-01 )
//       ( 7.925788e-02  0.000000e+00  9.969545e-01 )
//       ( 4.758667e-02  0.000000e+00  9.989672e-01 )
//       ( 1.586755e-02  0.000000e+00  9.999741e-01 )
//       ( -1.586755e-02  0.000000e+00  9.999741e-01 )
//       ( -4.758667e-02  0.000000e+00  9.989672e-01 )
//       ( -7.925788e-02  0.000000e+00  9.969545e-01 )
//       ( -1.108493e-01  0.000000e+00  9.939378e-01 )
//       ( -1.423291e-01  0.000000e+00  9.899204e-01 )
//       ( -1.736655e-01  0.000000e+00  9.849062e-01 )
//       ( -2.048271e-01  0.000000e+00  9.789003e-01 )
//       ( -2.357825e-01  0.000000e+00  9.719087e-01 )
//       ( -2.665005e-01  0.000000e+00  9.639385e-01 )
//       ( -2.969501e-01  0.000000e+00  9.549977e-01 )
//       ( -3.271007e-01  0.000000e+00  9.450953e-01 )
//       ( -3.569219e-01  0.000000e+00  9.342413e-01 )
//       ( -3.863838e-01  0.000000e+00  9.224465e-01 )
//       ( -4.154566e-01  0.000000e+00  9.097230e-01 )
//       ( -4.441110e-01  0.000000e+00  8.960834e-01 )
//       ( -4.723183e-01  0.000000e+00  8.815415e-01 )
//       ( -5.000500e-01  0.000000e+00  8.661120e-01 )
//       ( -5.272782e-01  0.000000e+00  8.498104e-01 )
//       ( -5.539755e-01  0.000000e+00  8.326531e-01 )
//       ( -5.801149e-01  0.000000e+00  8.146574e-01 )
//       ( -6.056702e-01  0.000000e+00  7.958414e-01 )
//       ( -6.306157e-01  0.000000e+00  7.762241e-01 )
//       ( -6.549262e-01  0.000000e+00  7.558251e-01 )
//       ( -6.785773e-01  0.000000e+00  7.346652e-01 )
//       ( -7.015450e-01  0.000000e+00  7.127654e-01 )
//       ( -7.238064e-01  0.000000e+00  6.901480e-01 )
//       ( -7.453390e-01  0.000000e+00  6.668357e-01 )
//       ( -7.661210e-01  0.000000e+00  6.428519e-01 )
//       ( -7.861317e-01  0.000000e+00  6.182208e-01 )
//       ( -8.053508e-01  0.000000e+00  5.929672e-01 )
//       ( -8.237589e-01  0.000000e+00  5.671166e-01 )
//       ( -8.413377e-01  0.000000e+00  5.406949e-01 )
//       ( -8.580692e-01  0.000000e+00  5.137288e-01 )
//       ( -8.739368e-01  0.000000e+00  4.862454e-01 )
//       ( -8.889243e-01  0.000000e+00  4.582723e-01 )
//       ( -9.030168e-01  0.000000e+00  4.298379e-01 )
//       ( -9.162001e-01  0.000000e+00  4.009706e-01 )
//       ( -9.284608e-01  0.000000e+00  3.716996e-01 )
//       ( -9.397866e-01  0.000000e+00  3.420543e-01 )
//       ( -9.501661e-01  0.000000e+00  3.120646e-01 )
//       ( -9.595889e-01  0.000000e+00  2.817607e-01 )
//       ( -9.680455e-01  0.000000e+00  2.511731e-01 )
//       ( -9.755273e-01  0.000000e+00  2.203326e-01 )
//       ( -9.820269e-01  0.000000e+00  1.892702e-01 )
//       ( -9.875376e-01  0.000000e+00  1.580172e-01 )
//       ( -9.920540e-01  0.000000e+00  1.266051e-01 )
//       ( -9.955715e-01  0.000000e+00  9.506555e-02 )
//       ( -9.980865e-01  0.000000e+00  6.343026e-02 )
//       ( -9.995965e-01  0.000000e+00  3.173111e-02 )
//       ( -1.000100e+00  0.000000e+00  1.224769e-16 )
//    );
//   }
// );

// ************************************************************************* //
