greenhouse_A/system/onGreenhouse
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes data on a surface 
\*---------------------------------------------------------------------------*/

type surfaces; 
interpolationScheme cellPointFace; 

fields  (p);

surfaceFormat raw;

surfaces
(
   greenhouse
   {
      type patch;
      patches (greenhouse);
      interpolate true;
      triangulate true;
   }
);

// ************************************************************************* //
